// •	Първи ред – Цена за килограм зеленчуци – реално число[0.00… 1000.00]
// •	Втори ред – Цена за килограм плодове – реално число[0.00… 1000.00]
// •	Трети ред – Общо килограми на зеленчуците – цяло число[0… 1000]
// •	Четвърти ред – Общо килограми на плодовете – цяло число[0… 1000]
// Градинар продавал реколтата от градината си на зеленчуковата борса. Продава зеленчуци за 
// N лева на килограм и плодове за M лева за килограм. Напишете програма, която да пресмята приходите от реколтата
//  в евро ( ако приемем, че едно евро е равно на 1.94лв).
function vegitables (input){
    let kgVegPrice=Number(input[0]);
    let kgFrPrice=Number(input[1]);
    let kgSummaryVeg=Number(input[2]);
    let kgSummaryFruits=Number(input[3]);

    let finalPrice= ((kgVegPrice * kgSummaryVeg) + (kgFrPrice * kgSummaryFruits)) / 1.94;
    console.log((finalPrice).toFixed(2))

}
vegitables(["0.194", "19.4", "10", "10"])